<?php

namespace App\Console\Commands;

use Illuminate\Console\Command;
use App\User;

class CheckInviter extends Command
{
    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'check:inviter';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Command description';

    /**
     * Create a new command instance.
     *
     * @return void
     */
    public function __construct()
    {
        parent::__construct();
    }

    private $dict = [
            // '范光明'=>3,
            // '陳美汝'=>13,
            // '陳碧珠'=>15,
            // '陳玉美'=>18,
            // '許成'=>21,
            // '羅生沂'=>22,
            // '許文達'=>24,
            // '蔡素月'=>29,
            // '李朝安'=>31,
            // '莊德清'=>32,
            '郭幼能'=>36,
            '厲秀萍'=>48,
            '謝黃春妹'=>49,
            '劉秀琴'=>60,
            '彭玉珍'=>64,
            '曾有銀'=>81,
            '謝美玉'=>84,
            '鍾秀鳳'=>105,
            '陳麗文'=>109,
            '鍾彭秀妹'=>110,
            '羅國涼'=>127,
            '黃思樺'=>144,
            '李桂榮'=>152,
            '江秀密'=>158,
            '廖趙玉琴'=>159,
            '鄒春玉'=>164,
            '鄒春櫻'=>198,
            '徐秋香'=>235,
            '黃丞薇'=>243,
            '邱月嬌'=>254,
            '陳春蘭'=>255,
            '黃鳳英'=>279,
            '周淑容'=>328,
            '鍾雲珍'=>340,
            '邱漢水'=>350,
            '邵朝嘉'=>352,
            '呂德星'=>384,
            '邱善惠'=>388,
            '林秋菊'=>400,
            '江秝甄'=>403,
            // '莊吳杏'=>418,
            // '余碧華'=>431,
            // '黃秋蘭'=>449,
            // '莊進樑'=>483,
            // '曾桂甜'=>510,
            // '陳黃秋榮'=>534,
            // '湯美齡'=>565,
            // '劉錢蒼'=>610,
            // '吳巧玲'=>611,
            // '羅徐蕉妹'=>612,
            // '嚴峰'=>646,
            // '雷瑞玉'=>666,
            // '岳黃早妹'=>672,
            // '陳秋鈴'=>724,
            // '林珮絲'=>729,
            // '林明志'=>734,
            // '許張麗春'=>757,
            // '王昭紋'=>789,
            // '翁林廷肇'=>793,
            // '劉秀娟'=>814,
            // '呂玉珍'=>833,
            // '徐貴妹'=>942,
            // '吳家成'=>944,
            // '陳春蘭'=>1012,
            // '徐碧珠'=>1026,
            // '劉秀娟'=>1050,
            // '徐碧珠'=>1053,
            // '鍾秀鳳'=>1116,
            // '王月嬌'=>1254,
            // '姜春霞'=>1317,
            // '楊金鳳'=>1327,
            // '王映月'=>1365,
            // '陳萬和'=>1366,
            // '鍾秀鳳'=>1466,
            // '徐秋香'=>1773,
            // '藍徐碧珠'=>2238,
            // '葉竹豈'=>2240,
            // '葉王淑娟'=>2241,
            // '岳昌宏'=>2242,
            // '張淑蝦'=>2248,
            // '陳明月'=>2249,
            // '黃丞薇'=>2301,
            // '雷瑞玉'=>2314,
            // '劉錢蒼'=>2334,
            // '吳巧玲'=>2342,
            // '鍾彭秀妹'=>2365,
            // '陳萬和'=>2443,
            // '葉竹豈'=>2505,
            // '周淑容'=>2509,
            // '余碧華'=>2515,
            // '黃秋蘭'=>2522,
            // '李桂榮'=>2701,
            // '李桂榮'=>2702,
            // '李桂榮'=>2703,
            // '余碧華'=>2776,
            // '陳春蘭'=>2790,
            // '陳麗文'=>2796,
            // '陳麗文'=>2945,
            // '吳巧玲'=>3194,
            // '吳巧玲'=>3196,
            // '邱月嬌'=>3217
        ];

    /**
     * Execute the console command.
     *
     * @return mixed
     */
    public function handle()
    {
        foreach ($this->dict as $name => $id) {
            User::where('inviter',$name)->whereNull('inviter_id')->update([
                'inviter_id'=>$id
            ]);

            $this->info('inviter : '.$name);
        }

        $this->info('!! Done !!');
    }
}
